In [1]:
import pandas as pd

In [2]:
rows = []
for i in range(10):
    rows.append({'id': i, 'dado': 'dado {}'.format(i)})
rows

[{'id': 0, 'dado': 'dado 0'},
 {'id': 1, 'dado': 'dado 1'},
 {'id': 2, 'dado': 'dado 2'},
 {'id': 3, 'dado': 'dado 3'},
 {'id': 4, 'dado': 'dado 4'},
 {'id': 5, 'dado': 'dado 5'},
 {'id': 6, 'dado': 'dado 6'},
 {'id': 7, 'dado': 'dado 7'},
 {'id': 8, 'dado': 'dado 8'},
 {'id': 9, 'dado': 'dado 9'}]

In [3]:
rows_to_delete = pd.Series([True, True, True, False,False,False,False,False,False,False])

In [6]:
df = pd.DataFrame(rows)
df[rows_to_delete]

     dado  id
0  dado 0   0
1  dado 1   1
2  dado 2   2

In [10]:
o = df.copy()
o = o[~rows_to_delete]
o

     dado  id
3  dado 3   3
4  dado 4   4
5  dado 5   5
6  dado 6   6
7  dado 7   7
8  dado 8   8
9  dado 9   9

In [24]:
df

     dado  id
0  dado 0   0
1  dado 1   1
2  dado 2   2
3  dado 3   3
4  dado 4   4
5  dado 5   5
6  dado 6   6
7  dado 7   7
8  dado 8   8
9  dado 9   9

In [26]:
ids = df['id']
df[rows_to_delete] = None
df
df['id'] = ids
df

     dado  id
0    None   0
1    None   1
2    None   2
3  dado 3   3
4  dado 4   4
5  dado 5   5
6  dado 6   6
7  dado 7   7
8  dado 8   8
9  dado 9   9

In [32]:
df.loc[df['id'].isin([0,1,2])]

   dado  id
0  None   0
1  None   1
2  None   2

In [34]:
df.columns

Index(['dado', 'id'], dtype='object')

In [39]:
import numpy as np
isinstance(np.nan, type(None))
type(np.nan)

float

In [42]:
isinstance(2, (float, int))

True